#include "ゲームデータ構造.h"

年情報型				*const d年情報				= (年情報型 *)情報メモリアドレス::年情報;
ターン情報型			*const dターン情報			= (ターン情報型 *)情報メモリアドレス::ターン情報;
相場情報型				*const d相場情報			= (相場情報型 *)情報メモリアドレス::相場情報;
天気情報型				*const d天気情報			= (天気情報型 *)情報メモリアドレス::天気情報;

武将情報型				*const p武将情報			= (武将情報型 *)情報メモリアドレス::武将情報;
武将戸籍情報型			*const p武将戸籍情報		= (武将戸籍情報型 *)情報メモリアドレス::武将戸籍情報;

軍団情報型				*const p軍団情報			= (軍団情報型 *)情報メモリアドレス::軍団情報;
プレイヤ担当軍団情報型	*const pプレイヤ担当軍団情報= (プレイヤ担当軍団情報型 *)情報メモリアドレス::プレイヤ担当軍団情報;

大名情報型				*const p大名情報			= (大名情報型 *)情報メモリアドレス::大名情報;

城情報型				*const p城情報				= (城情報型 *)情報メモリアドレス::城情報;
城付加情報型			*const p城付加情報			= (城付加情報型 *)情報メモリアドレス::城付加情報;

地域情報型				*const p地域情報			= (地域情報型 *)情報メモリアドレス::地域情報;

官位情報型				*const p官位情報			= (官位情報型 *)情報メモリアドレス::官位情報;
家宝情報型				*const p家宝情報			= (家宝情報型 *)情報メモリアドレス::家宝情報;

環境設定情報型			*const d環境設定情報		= (環境設定情報型 *)情報メモリアドレス::環境設定情報;
環境設定拡張情報型		*const d環境設定拡張情報	= (環境設定拡張情報型 *)情報メモリアドレス::環境設定拡張情報;

